snippets/app/controllers/snippets_controller.rb

SELECT "snippets".* FROM "snippets"
---
  def index
    @snippets = Snippet.all

INSERT INTO "snippets" ("updated_at", "created_at", "title", "language", "code") VALUES ('2011-09-02 13:19:52.396102', '2011-09-02 13:19:52.396102', 'teste', 'gete', 'teste')
---
  def create
    @snippet = Snippet.new(params[:snippet])

    if @snippet.save

UPDATE "snippets" SET "updated_at" = '2011-09-02 13:28:34.725262', "title" = 'teste2' WHERE "snippets"."id" = 1
---
  def update
    if @snippet.update_attributes(params[:snippet])

DELETE FROM "snippets" WHERE "snippets"."id" = 1
---
  def destroy
    if @snippet.destroy